import React from 'react';
import Button from '@mui/material/Button';
import Introduction from '../components/sections/Introduction';
const Home = () => {
    return (
      <>
        <Introduction></Introduction>
        <div>현전하는 해례본의 원문에는 易, 耳 대신에 昜, 矣 글자가 쓰여 있으나, 이는 찢겨나간 부분을 복원하는 과정에서 오기(誤記)된 것이다. 훈민정음 해례본 문서로.
'中國'은 ‘중심이 되는 나라’ 정도를 의미하는 것으로 좁게는 중원 일대를 근거로 하는 왕조를 가리키며, 넓게는 역대 중화제국이 스스로를 가리키던 말이었다. 당시 기준으로는 명나라를 가리킨다.#. 훈민정음 언해본 서문에는 '중국' 밑에 주석이 붙어 있으며, 이렇게 되어 있다. "중국은 황제 계신 나라이니 우리나라에서 보통 강남(江南)이라 하느니라." 명나라의 수도는 북경이었지만, 처음에는 남경에서 건국되었기 때문에 강남이라는 이칭을 갖고 있었다. 중국(中國)이 '나라 안', 즉 지역끼리 언어 호환이 안되었다는 설도 있는데, 훈민정음 언해본에서 "중국과 달라서"로 기록되어 있어서 '나라 안'이라는 주장은 틀린 주장이다.
文字는 전통적으로 한자를 칭하는 표현으로, 최소한 설문해자 때부터 등장한다(비슷한 맥락으로 한문은 원래 文이라고 불렀다). 그러나 홍윤표 전 연세대 교수는 원문의 文字가 뜻하는 것이 글자 또는 한자가 아니라 '한자로 된 숙어나 성구(成句) 또는 문장'이라고 한다. '문자 쓰고 앉아 있네' 같은 표현의 '문자'와 같다고 한다. 즉 '(우리)나라의 말이 중국과 달라서 한문 구(句)·문장과는 서로 통하지 않으므로, 이런 까닭으로 (한문 구·문장을 쓸 줄 모르는)어리석은 백성이 말하고자 할 바가 있어도 능히 말할 수가 없다'라고 한다. 또한 왜 '문자'를 새로 만들었는데 훈민정문(文)이나 훈민정자(字)가 아니라 훈민정음(音)인지도 이 점과 연결해서 설명하고 있다. 이에 그의 구체적 주장은 이 글의 4쪽부터 13쪽, 그리고 여기로.
'통하지'라고 된 부분의 언해 부분은 'ᄉᆞᄆᆞᆺ디'인데, 이는 중세국어의 'ᄉᆞᄆᆞᆾ다'의 활용형으로, 직역하면 '사무치지'에 해당한다. 현대 국어에서 '사무치다'는 '깊이 스며들다'라는 뜻이지만, 중세 국어에서는 보다 포괄적인 의미를 지녀 '통하다'를 뜻하는 말로 널리 쓰였다.
'어리석은'이라고 된 부분의 언해 부분은 '어린'인데, 이는 '어린이'를 뜻하는게 아니고 '어리석다'의 옛 표현이 '어리다'였다. 다만, 현대에 '어리석다'가 가지는 부정적인 뉘앙스와는 거리가 있으며, 여기서 '어리석은 백성'은 한자와 한문 교육을 받지 못한 '배우지 못한 백성' 정도로 이해하면 된다.
'능히'라고 된 부분의 언해 부분은 '시러'인데, 직역하면 '얻어'('실어'가 아니다)이다.[4] 중세 한국어의 '싣다'는 현대 한국어의 '싣다'의 뜻을 지닌 것과 '얻다'라는 뜻을 지닌 것이 두 종류 있었다. 이 단어에서 파생부사 '시러곰'(능히)이 생겼다.
'사람이'라고 된 부분의 언해 부분을 직역하면 '놈이'이다.(위의 원문에 보면 '노미'라는 표기가 보일 것이다.) 당대의 '놈'은 비속어가 아니라 '사람'을 가리키는 평칭이었다는 해석에 근거한 것이다. 그러나 '者'를 '경우' 또는 '(~하는) 것'으로 해석해야 한다는 주장도 있다(정요일, 2008).
'펴디몯ᄒᆞᇙ노미하니라'에서 '하니라'는 '많으니라'의 의미이다. 오늘날에 쓰는 'do' 의미의 '하다'는 'ᄒᆞ다'였다.
'젼ᄎᆞ로'는 이두에서는 '詮次以'로 썼으며, 본래 뜻은 '순서에 따라'였으나 '까닭으로'라는 뜻으로 의미가 변화했다.</div>
        <Button color="primary">t1t1</Button>
      </>
    );
  }
  
  export default Home;